org/_posts/Java/2013-07-19-java-web-developing-misc.org
#+begin_html
---
layout: tech-post
title: Java web 开发小记
category: Java
change_frequency: monthly
tag: java,web
---
#+end_html
本文意在记录自己在用java进行web开发中积累的知识点、技巧以及经验。
【待完善】

** 数据映射DAO
*** ibatis debug
    配置log4j输出ibatis的调试日志，方便进行排查问题。
    配置如下：
    #+BEGIN_SRC sh :eval no 
     # Global logging configuration
     log4j.rootLogger=ERROR, stdout
    
     log4j.logger.com.ibatis=DEBUG

     # shows SQL of prepared statements
     #log4j.logger.java.sql.Connection=DEBUG

     # shows parameters inserted into prepared statements
     #log4j.logger.java.sql.PreparedStatement=DEBUG

     # shows query results
     #log4j.logger.java.sql.ResultSet=DEBUG

     #log4j.logger.java.sql.Statement=DEBUG

     # Console output
     log4j.appender.stdout=org.apache.log4j.ConsoleAppender
     log4j.appender.stdout.layout=org.apache.log4j.PatternLayout
     log4j.appender.stdout.layout.ConversionPattern=%5p [%t] - %m%n
    #+END_SRC
