wintersmith/contents/articles/Java/2013-07-19-java-web-developing-misc.html
---
date: 2013-07-19
template: tech.jade
title: Java web 开发小记
category: Java
change_frequency: monthly
tag: java,web
---
<p>
本文意在记录自己在用java进行web开发中积累的知识点、技巧以及经验。
【待完善】
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">数据映射DAO</a>
<ul>
<li><a href="#sec-1-1">ibatis debug</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">数据映射DAO</h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">ibatis debug</h4>
<div class="outline-text-4" id="text-1-1">

<p>    配置log4j输出ibatis的调试日志，方便进行排查问题。
    配置如下：
</p>


<pre class="example"># Global logging configuration
log4j.rootLogger=ERROR, stdout

log4j.logger.com.ibatis=DEBUG

# shows SQL of prepared statements
#log4j.logger.java.sql.Connection=DEBUG

# shows parameters inserted into prepared statements
#log4j.logger.java.sql.PreparedStatement=DEBUG

# shows query results
#log4j.logger.java.sql.ResultSet=DEBUG

#log4j.logger.java.sql.Statement=DEBUG

# Console output
log4j.appender.stdout=org.apache.log4j.ConsoleAppender
log4j.appender.stdout.layout=org.apache.log4j.PatternLayout
log4j.appender.stdout.layout.ConversionPattern=%5p [%t] - %m%n
</pre>

</div>
</div>
</div>
